cases/openfoam-4.x/CounterFlow/Coarse/laminarPimpleSMOKE-flamelet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 4.5)	//0
    (0 0 0.5)	//1
    (0 0 -0.5)	//2
    (0 0 -4.5)	//3
    (0.499923847578196 -0.008726203218642 4.5)	//4
    (0.499923847578196 -0.008726203218642 0.5)	//5
    (0.499923847578196 -0.008726203218642 -0.5)	//6
    (0.499923847578196 -0.008726203218642 -4.5)	//7
    (0.599908617093835 -0.010471443862370 4.5)	//8
    (0.599908617093835 -0.010471443862370 0.5)	//9
    (0.599908617093835 -0.010471443862370 -0.5)	//10
    (0.599908617093835 -0.010471443862370 -4.5)	//11
    (5.499162323360152 -0.095988235405059 4.5)	//12
    (5.499162323360152 -0.095988235405059 0.5)	//13
    (5.499162323360152 -0.095988235405059 -0.5)	//14
    (5.499162323360152 -0.095988235405059 -4.5)	//15
    (0 0 4.5)	//16
    (0 0 0.5)	//17
    (0 0 -0.5)	//18
    (0 0 -4.5)	//19
    (0.499923847578196 0.008726203218642 4.5)	//20
    (0.499923847578196 0.008726203218642 0.5)	//21
    (0.499923847578196 0.008726203218642 -0.5)	//22
    (0.499923847578196 0.008726203218642 -4.5)	//23
    (0.599908617093835 0.010471443862370 4.5)	//24
    (0.599908617093835 0.010471443862370 0.5)	//25
    (0.599908617093835 0.010471443862370 -0.5)	//26
    (0.599908617093835 0.010471443862370 -4.5)	//27
    (5.499162323360152 0.095988235405059 4.5)	//28
    (5.499162323360152 0.095988235405059 0.5)	//29
    (5.499162323360152 0.095988235405059 -0.5)	//30
    (5.499162323360152 0.095988235405059 -4.5)	//31
);

blocks
(
    hex (0 4 5 1 16 20 21 17) (40 160 1) simpleGrading (1 0.25 1)	//block 1 (x,z,y)
    hex (1 5 6 2 17 21 22 18) (40 80 1) simpleGrading (1 1 1)	//block 2 (x,z,y) 
    hex (2 6 7 3 18 22 23 19) (40 160 1) simpleGrading (1 4 1)	//block 3 (x,z,y)
    hex (10 14 15 11 26 30 31 27) (160 130 1) simpleGrading (5 5 1)	//block 4 (x,z,y)
    hex (9 13 14 10 25 29 30 26) (160 80 1) simpleGrading (5 1 1)	//block 5 (x,z,y)
    hex (8 12 13 9 24 28 29 25) (160 130 1) simpleGrading (5 0.2 1)	//block 6 (x,z,y)
    hex (5 9 10 6 21 25 26 22) (8 80 1) simpleGrading (1 1 1)	//block 7 (x,z,y)
);

edges
(

);

boundary
(
    fuelinlet	//done
    {
        type patch;
        faces
        (
            (7 3 19 23)
        );
    }

    oxidizerinlet	//done
    {
        type patch;
        faces
        (
            (0 4 20 16)
        );
    }

    outlet	//done	
    {
        type patch;
        faces
        (
            (8 12 28 24)
            (13 14 30 29)
            (15 11 27 31)
            (12 13 29 28)
            (14 15 31 30)
        );
    }
    bottom	//done
    {
        type wedge;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (10 14 15 11)
            (9 13 14 10)
            (8 12 13 9)
            (5 9 10 6)
        );
    }
    top	//done
    {
        type wedge;
        faces
        (
            (16 20 21 17)
            (17 21 22 18)
            (18 22 23 19)
            (26 30 31 27)
            (25 29 30 26)
            (24 28 29 25)
            (21 25 26 22)
        );
    }
    walls	//done
    {
        type walls;
        faces
        (
            (4 5 21 20)
            (5 9 25 21)
            (9 8 24 25)
            (10 6 22 26)
            (11 10 26 27)
            (6 7 23 22)     
        );
    }
)

mergePatchPairs
(

);

// ************************************************************************* //
